package chapter06.EX01;

public class Using_Class01 {

	public static void main(String[] args) {
		// 절차지향 프로그램 (Procedural Program[PP] : c 언어, 시간의 순서에 따라서 프로그래밍 하는 방식)
				//람보르기니 : 한 공장에서 모든 제품을 완성, 성능 좋음, 제작하기 어려움
				//			고장이 났을 때 생산 된 공장에서, 제품을 모두 분해해서 다시 제작
		
		// 객체지향 프로그램 (Object Oriented Program[OOP] : Java, 프로그램을 객체, 객체, 객체)
				// 일반 자동차 : 자동차의 부품을 표준화 해서, 타이어(객체), 유리(객체), 엔진(객체), 핸들(객체)
				//				객체를 조립하는 형식으로 제품을 완료
				//			// 개발 하기가 굉장히 쉬움, 수리하기도 쉬움
		
		
		//1. 클래스 내부의 요소들
			// 필드
			// 생성자
			// 메소드
			// 이너클래스 ( 내부클래스)
		
		//2. 클래스 외부의 요소들
			// 패키지
			// 임포트
			// 외부클래스
		
	}

}
